;******************************************************************************
;* TMS320C6x C/C++ Codegen                                         PC v7.4.24 *
;* Date/Time created: Wed Feb 27 14:48:30 2019                                *
;******************************************************************************
	.compiler_opts --abi=coffabi --c64p_l1d_workaround=off --endian=little --hll_source=on --long_precision_bits=40 --mem_model:code=near --mem_model:const=data --mem_model:data=far_aggregates --object_format=coff --silicon_version=6740 --symdebug:dwarf 

;******************************************************************************
;* GLOBAL FILE PARAMETERS                                                     *
;*                                                                            *
;*   Architecture      : TMS320C674x                                          *
;*   Optimization      : Disabled                                             *
;*   Optimizing for    : Compile time, Ease of Development                    *
;*                       Based on options: no -o, no -ms                      *
;*   Endian            : Little                                               *
;*   Interrupt Thrshld : Disabled                                             *
;*   Data Access Model : Far Aggregate Data                                   *
;*   Pipelining        : Disabled                                             *

           EXTU    .S1     A3,17,1,A3        ; |687| 
           NOP             3
           ADD     .L2X    A3,B4,B4          ; |687| 
           STW     .D2T2   B4,*+SP(8)        ; |687| 
	.dwpsn	file "../Lab Files/L138_aic3106_init.c",line 688,column 3,is_stmt
           LDW     .D2T2   *+SP(4),B5        ; |688| 
           NOP             4
           SHRU    .S2     B5,15,B5          ; |688| 
           ADD     .L2     B5,B4,B4          ; |688| 
           STW     .D2T2   B4,*+SP(8)        ; |688| 
	.dwpsn	file "../Lab Files/L138_aic3106_init.c",line 690,column 3,is_stmt
           ZERO    .L2     B5
           SET     .S2     B5,0x0,0x1e,B5
           CMPGTU  .L2     B4,B5,B0          ; |690| 
   [!B0]   BNOP    .S1     $C$L86,5          ; |690| 
           ; BRANCHCC OCCURS {$C$L86}        ; |690| 
;** --------------------------------------------------------------------------*
	.dwpsn	file "../Lab Files/L138_aic3106_init.c",line 690,column 24,is_stmt

           ZERO    .L2     B4
||         MV      .S2     B4,B5

           SET     .S2     B4,0x0,0x1e,B4
           SUB     .L2     B5,B4,B4          ; |690| 
           STW     .D2T2   B4,*+SP(8)        ; |690| 
;** --------------------------------------------------------------------------*
$C$L86:    
	.dwpsn	file "../Lab Files/L138_aic3106_init.c",line 692,column 3,is_stmt

           MV      .L1X    B4,A4             ; |692| 
||         STW     .D2T2   B4,*+DP(_prand_seed) ; |692| 

	.dwpsn	file "../Lab Files/L138_aic3106_init.c",line 693,column 1,is_stmt
           ADD     .L2     8,SP,SP           ; |693| 
	.dwcfi	cfa_offset, 0
	.dwcfi	cfa_offset, 0
$C$DW$235	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$235, DW_AT_low_pc(0x00)
	.dwattr $C$DW$235, DW_AT_TI_return
           RETNOP  .S2     B3,5              ; |693| 
           ; BRANCH OCCURS {B3}              ; |693| 
	.dwattr $C$DW$232, DW_AT_TI_end_file("../Lab Files/L138_aic3106_init.c")
	.dwattr $C$DW$232, DW_AT_TI_end_line(0x2b5)
	.dwattr $C$DW$232, DW_AT_TI_end_column(0x01)
	.dwendentry
	.dwendtag $C$DW$232

	.sect	".text"
	.clink
	.global	_prand

$C$DW$236	.dwtag  DW_TAG_subprogram, DW_AT_name("prand")
	.dwattr $C$DW$236, DW_AT_low_pc(_prand)
	.dwattr $C$DW$236, DW_AT_high_pc(0x00)
	.dwattr $C$DW$236, DW_AT_TI_symbol_name("_prand")
	.dwattr $C$DW$236, DW_AT_external
	.dwattr $C$DW$236, DW_AT_type(*$C$DW$T$59)
	.dwattr $C$DW$236, DW_AT_TI_begin_file("../Lab Files/L138_aic3106_init.c")
	.dwattr $C$DW$236, DW_AT_TI_begin_line(0x2b7)
	.dwattr $C$DW$236, DW_AT_TI_begin_column(0x09)
	.dwattr $C$DW$236, DW_AT_TI_max_frame_size(0x08)
	.dwpsn	file "../Lab Files/L138_aic3106_init.c",line 696,column 1,is_stmt,address _prand

	.dwfde $C$DW$CIE, _prand

;******************************************************************************
;* FUNCTION NAME: prand                                                       *
;*                                                                            *
;*   Regs Modified     : A3,A4,B0,B3,B4,B5,SP                                 *
;*   Regs Used         : A3,A4,B0,B3,B4,B5,DP,SP                              *
;*   Local Frame Size  : 0 Args + 0 Auto + 4 Save = 4 byte                    *
;******************************************************************************
_prand:
;** --------------------------------------------------------------------------*
	.dwcfi	cfa_offset, 0
	.dwcfi	save_reg_to_reg, 228, 19
           STW     .D2T2   B3,*SP--(8)       ; |696| 
	.dwcfi	cfa_offset, 8
	.dwcfi	save_reg_to_mem, 19, 0
	.dwpsn	file "../Lab Files/L138_aic3106_init.c",line 697,column 1,is_stmt
$C$DW$237	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$237, DW_AT_low_pc(0x00)
	.dwattr $C$DW$237, DW_AT_name("_rand31_next")
	.dwattr $C$DW$237, DW_AT_TI_call
           CALLP   .S2     _rand31_next,B3
$C$RL76:   ; CALL OCCURS {_rand31_next} {0}  ; |697| 
           SHRU    .S1     A4,18,A3          ; |697| 
           ADDK    .S1     -4096,A3          ; |697| 
           EXT     .S1     A3,16,16,A4       ; |697| 
	.dwpsn	file "../Lab Files/L138_aic3106_init.c",line 698,column 1,is_stmt
           LDW     .D2T2   *++SP(8),B3       ; |698| 
           NOP             4
	.dwcfi	cfa_offset, 0
	.dwcfi	restore_reg, 19
	.dwcfi	cfa_offset, 0
$C$DW$238	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$238, DW_AT_low_pc(0x00)
	.dwattr $C$DW$238, DW_AT_TI_return
           RETNOP  .S2     B3,5              ; |698| 
           ; BRANCH OCCURS {B3}              ; |698| 
	.dwattr $C$DW$236, DW_AT_TI_end_file("../Lab Files/L138_aic3106_init.c")
	.dwattr $C$DW$236, DW_AT_TI_end_line(0x2ba)
	.dwattr $C$DW$236, DW_AT_TI_end_column(0x01)
	.dwendentry
	.dwendtag $C$DW$236

;*****************************************************************************
;* UNDEFINED EXTERNAL REFERENCES                                             *
;*****************************************************************************
	.global	_malloc
	.global	_EVMOMAPL138_init
	.global	_EVMOMAPL138_initRAM
	.global	_EVMOMAPL138_pinmuxConfig
	.global	_EVMOMAPL138_lpscTransition
	.global	_USTIMER_init
	.global	_AIC3106_writeRegister
	.global	_vectors

;******************************************************************************
;* BUILD ATTRIBUTES                                                           *
;******************************************************************************
	.battr "TI", Tag_File, 1, Tag_ABI_stack_align_needed(0)
	.battr "TI", Tag_File, 1, Tag_ABI_stack_align_preserved(0)
	.battr "TI", Tag_File, 1, Tag_Tramps_Use_SOC(1)

;******************************************************************************
;* TYPE INFORMATION                                                           *
;******************************************************************************

$C$DW$T$30	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$30, DW_AT_byte_size(0xa80)
$C$DW$239	.dwtag  DW_TAG_member
	.dwattr $C$DW$239, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$239, DW_AT_name("REVID")
	.dwattr $C$DW$239, DW_AT_TI_symbol_name("_REVID")
	.dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$240	.dwtag  DW_TAG_member
	.dwattr $C$DW$240, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$240, DW_AT_name("RSVD0")
	.dwattr $C$DW$240, DW_AT_TI_symbol_name("_RSVD0")
	.dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$241	.dwtag  DW_TAG_member
	.dwattr $C$DW$241, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$241, DW_AT_name("INTEVAL")
	.dwattr $C$DW$241, DW_AT_TI_symbol_name("_INTEVAL")
	.dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$242	.dwtag  DW_TAG_member
	.dwattr $C$DW$242, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$242, DW_AT_name("RSVD1")
	.dwattr $C$DW$242, DW_AT_TI_symbol_name("_RSVD1")
	.dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$243	.dwtag  DW_TAG_member
	.dwattr $C$DW$243, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$243, DW_AT_name("MERRPR0")
	.dwattr $C$DW$243, DW_AT_TI_symbol_name("_MERRPR0")
	.dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$244	.dwtag  DW_TAG_member
	.dwattr $C$DW$244, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$244, DW_AT_name("RSVD2")
	.dwattr $C$DW$244, DW_AT_TI_symbol_name("_RSVD2")
	.dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$245	.dwtag  DW_TAG_member
	.dwattr $C$DW$245, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$245, DW_AT_name("MERRCR0")
	.dwattr $C$DW$245, DW_AT_TI_symbol_name("_MERRCR0")
	.dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$246	.dwtag  DW_TAG_member
	.dwattr $C$DW$246, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$246, DW_AT_name("RSVD3")
	.dwattr $C$DW$246, DW_AT_TI_symbol_name("_RSVD3")
	.dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
	.dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$247	.dwtag  DW_TAG_member
	.dwattr $C$DW$247, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$247, DW_AT_name("PERRPR")
	.dwattr $C$DW$247, DW_AT_TI_symbol_name("_PERRPR")
	.dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
	.dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$248	.dwtag  DW_TAG_member
	.dwattr $C$DW$248, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$248, DW_AT_name("RSVD4")
	.dwattr $C$DW$248, DW_AT_TI_symbol_name("_RSVD4")
	.dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
	.dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$249	.dwtag  DW_TAG_member
	.dwattr $C$DW$249, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$249, DW_AT_name("PERRCR")
	.dwattr $C$DW$249, DW_AT_TI_symbol_name("_PERRCR")
	.dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
	.dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$250	.dwtag  DW_TAG_member
	.dwattr $C$DW$250, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$250, DW_AT_name("RSVD5")
	.dwattr $C$DW$250, DW_AT_TI_symbol_name("_RSVD5")
	.dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
	.dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$251	.dwtag  DW_TAG_member
	.dwattr $C$DW$251, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$251, DW_AT_name("PTCMD")
	.dwattr $C$DW$251, DW_AT_TI_symbol_name("_PTCMD")
	.dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
	.dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$252	.dwtag  DW_TAG_member
	.dwattr $C$DW$252, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$252, DW_AT_name("RSVD6")
	.dwattr $C$DW$252, DW_AT_TI_symbol_name("_RSVD6")
	.dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x124]
	.dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$253	.dwtag  DW_TAG_member
	.dwattr $C$DW$253, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$253, DW_AT_name("PTSTAT")
	.dwattr $C$DW$253, DW_AT_TI_symbol_name("_PTSTAT")
	.dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x128]
	.dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$254	.dwtag  DW_TAG_member
	.dwattr $C$DW$254, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$254, DW_AT_name("RSVD7")
	.dwattr $C$DW$254, DW_AT_TI_symbol_name("_RSVD7")
	.dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x12c]
	.dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$255	.dwtag  DW_TAG_member
	.dwattr $C$DW$255, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$255, DW_AT_name("PDSTAT0")
	.dwattr $C$DW$255, DW_AT_TI_symbol_name("_PDSTAT0")
	.dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x200]
	.dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$256	.dwtag  DW_TAG_member
	.dwattr $C$DW$256, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$256, DW_AT_name("PDSTAT1")
	.dwattr $C$DW$256, DW_AT_TI_symbol_name("_PDSTAT1")
	.dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x204]
	.dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$257	.dwtag  DW_TAG_member
	.dwattr $C$DW$257, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$257, DW_AT_name("RSVD8")
	.dwattr $C$DW$257, DW_AT_TI_symbol_name("_RSVD8")
	.dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x208]
	.dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$258	.dwtag  DW_TAG_member
	.dwattr $C$DW$258, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$258, DW_AT_name("PDCTL0")
	.dwattr $C$DW$258, DW_AT_TI_symbol_name("_PDCTL0")
	.dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x300]
	.dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$259	.dwtag  DW_TAG_member
	.dwattr $C$DW$259, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$259, DW_AT_name("PDCTL1")
	.dwattr $C$DW$259, DW_AT_TI_symbol_name("_PDCTL1")
	.dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x304]
	.dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$260	.dwtag  DW_TAG_member
	.dwattr $C$DW$260, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$260, DW_AT_name("RSVD9")
	.dwattr $C$DW$260, DW_AT_TI_symbol_name("_RSVD9")
	.dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x308]
	.dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$261	.dwtag  DW_TAG_member
	.dwattr $C$DW$261, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$261, DW_AT_name("PDCFG0")
	.dwattr $C$DW$261, DW_AT_TI_symbol_name("_PDCFG0")
	.dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x400]
	.dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$262	.dwtag  DW_TAG_member
	.dwattr $C$DW$262, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$262, DW_AT_name("PDCFG1")
	.dwattr $C$DW$262, DW_AT_TI_symbol_name("_PDCFG1")
	.dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x404]
	.dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$263	.dwtag  DW_TAG_member
	.dwattr $C$DW$263, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$263, DW_AT_name("RSVD10")
	.dwattr $C$DW$263, DW_AT_TI_symbol_name("_RSVD10")
	.dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x408]
	.dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$264	.dwtag  DW_TAG_member
	.dwattr $C$DW$264, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$264, DW_AT_name("MDSTAT")
	.dwattr $C$DW$264, DW_AT_TI_symbol_name("_MDSTAT")
	.dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x800]
	.dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$265	.dwtag  DW_TAG_member
	.dwattr $C$DW$265, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$265, DW_AT_name("RSVD11")
	.dwattr $C$DW$265, DW_AT_TI_symbol_name("_RSVD11")
	.dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x880]
	.dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$266	.dwtag  DW_TAG_member
	.dwattr $C$DW$266, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$266, DW_AT_name("MDCTL")
	.dwattr $C$DW$266, DW_AT_TI_symbol_name("_MDCTL")
	.dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0xa00]
	.dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$30

$C$DW$T$41	.dwtag  DW_TAG_typedef, DW_AT_name("psc_regs_t")
	.dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
$C$DW$T$42	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$T$42, DW_AT_address_class(0x20)

$C$DW$T$35	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$35, DW_AT_byte_size(0x2c0)
$C$DW$267	.dwtag  DW_TAG_member
	.dwattr $C$DW$267, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$267, DW_AT_name("REVID")
	.dwattr $C$DW$267, DW_AT_TI_symbol_name("_REVID")
	.dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$268	.dwtag  DW_TAG_member
	.dwattr $C$DW$268, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$268, DW_AT_name("RSVD0")
	.dwattr $C$DW$268, DW_AT_TI_symbol_name("_RSVD0")
	.dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$269	.dwtag  DW_TAG_member
	.dwattr $C$DW$269, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$269, DW_AT_name("PFUNC")
	.dwattr $C$DW$269, DW_AT_TI_symbol_name("_PFUNC")
	.dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$270	.dwtag  DW_TAG_member
	.dwattr $C$DW$270, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$270, DW_AT_name("PDIR")
	.dwattr $C$DW$270, DW_AT_TI_symbol_name("_PDIR")
	.dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$271	.dwtag  DW_TAG_member
	.dwattr $C$DW$271, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$271, DW_AT_name("PDOUT")
	.dwattr $C$DW$271, DW_AT_TI_symbol_name("_PDOUT")
	.dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$272	.dwtag  DW_TAG_member
	.dwattr $C$DW$272, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$272, DW_AT_name("PDIN")
	.dwattr $C$DW$272, DW_AT_TI_symbol_name("_PDIN")
	.dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$273	.dwtag  DW_TAG_member
	.dwattr $C$DW$273, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$273, DW_AT_name("PDCLR")
	.dwattr $C$DW$273, DW_AT_TI_symbol_name("_PDCLR")
	.dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$274	.dwtag  DW_TAG_member
	.dwattr $C$DW$274, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$274, DW_AT_name("RSVD1")
	.dwattr $C$DW$274, DW_AT_TI_symbol_name("_RSVD1")
	.dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$275	.dwtag  DW_TAG_member
	.dwattr $C$DW$275, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$275, DW_AT_name("GBLCTL")
	.dwattr $C$DW$275, DW_AT_TI_symbol_name("_GBLCTL")
	.dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$276	.dwtag  DW_TAG_member
	.dwattr $C$DW$276, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$276, DW_AT_name("AMUTE")
	.dwattr $C$DW$276, DW_AT_TI_symbol_name("_AMUTE")
	.dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$277	.dwtag  DW_TAG_member
	.dwattr $C$DW$277, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$277, DW_AT_name("DLBCTL")
	.dwattr $C$DW$277, DW_AT_TI_symbol_name("_DLBCTL")
	.dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
	.dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$278	.dwtag  DW_TAG_member
	.dwattr $C$DW$278, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$278, DW_AT_name("DITCTL")
	.dwattr $C$DW$278, DW_AT_TI_symbol_name("_DITCTL")
	.dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$279	.dwtag  DW_TAG_member
	.dwattr $C$DW$279, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$279, DW_AT_name("RSVD2")
	.dwattr $C$DW$279, DW_AT_TI_symbol_name("_RSVD2")
	.dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
	.dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$280	.dwtag  DW_TAG_member
	.dwattr $C$DW$280, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$280, DW_AT_name("RGBLCTL")
	.dwattr $C$DW$280, DW_AT_TI_symbol_name("_RGBLCTL")
	.dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
	.dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$281	.dwtag  DW_TAG_member
	.dwattr $C$DW$281, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$281, DW_AT_name("RMASK")
	.dwattr $C$DW$281, DW_AT_TI_symbol_name("_RMASK")
	.dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
	.dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$282	.dwtag  DW_TAG_member
	.dwattr $C$DW$282, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$282, DW_AT_name("RFMT")
	.dwattr $C$DW$282, DW_AT_TI_symbol_name("_RFMT")
	.dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
	.dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$283	.dwtag  DW_TAG_member
	.dwattr $C$DW$283, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$283, DW_AT_name("AFSRCTL")
	.dwattr $C$DW$283, DW_AT_TI_symbol_name("_AFSRCTL")
	.dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
	.dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$284	.dwtag  DW_TAG_member
	.dwattr $C$DW$284, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$284, DW_AT_name("ACLKRCTL")
	.dwattr $C$DW$284, DW_AT_TI_symbol_name("_ACLKRCTL")
	.dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
	.dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$285	.dwtag  DW_TAG_member
	.dwattr $C$DW$285, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$285, DW_AT_name("AHCLKRCTL")
	.dwattr $C$DW$285, DW_AT_TI_symbol_name("_AHCLKRCTL")
	.dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
	.dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$286	.dwtag  DW_TAG_member
	.dwattr $C$DW$286, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$286, DW_AT_name("RTDM")
	.dwattr $C$DW$286, DW_AT_TI_symbol_name("_RTDM")
	.dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
	.dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$287	.dwtag  DW_TAG_member
	.dwattr $C$DW$287, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$287, DW_AT_name("RINTCTL")
	.dwattr $C$DW$287, DW_AT_TI_symbol_name("_RINTCTL")
	.dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
	.dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$288	.dwtag  DW_TAG_member
	.dwattr $C$DW$288, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$288, DW_AT_name("RSTAT")
	.dwattr $C$DW$288, DW_AT_TI_symbol_name("_RSTAT")
	.dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
	.dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$289	.dwtag  DW_TAG_member
	.dwattr $C$DW$289, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$289, DW_AT_name("RSLOT")
	.dwattr $C$DW$289, DW_AT_TI_symbol_name("_RSLOT")
	.dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
	.dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$290	.dwtag  DW_TAG_member
	.dwattr $C$DW$290, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$290, DW_AT_name("RCLKCHK")
	.dwattr $C$DW$290, DW_AT_TI_symbol_name("_RCLKCHK")
	.dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
	.dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$291	.dwtag  DW_TAG_member
	.dwattr $C$DW$291, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$291, DW_AT_name("REVTCTL")
	.dwattr $C$DW$291, DW_AT_TI_symbol_name("_REVTCTL")
	.dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
	.dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$292	.dwtag  DW_TAG_member
	.dwattr $C$DW$292, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$292, DW_AT_name("RSVD3")
	.dwattr $C$DW$292, DW_AT_TI_symbol_name("_RSVD3")
	.dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
	.dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$293	.dwtag  DW_TAG_member
	.dwattr $C$DW$293, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$293, DW_AT_name("XGBLCTL")
	.dwattr $C$DW$293, DW_AT_TI_symbol_name("_XGBLCTL")
	.dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
	.dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$294	.dwtag  DW_TAG_member
	.dwattr $C$DW$294, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$294, DW_AT_name("XMASK")
	.dwattr $C$DW$294, DW_AT_TI_symbol_name("_XMASK")
	.dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
	.dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$295	.dwtag  DW_TAG_member
	.dwattr $C$DW$295, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$295, DW_AT_name("XFMT")
	.dwattr $C$DW$295, DW_AT_TI_symbol_name("_XFMT")
	.dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
	.dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$296	.dwtag  DW_TAG_member
	.dwattr $C$DW$296, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$296, DW_AT_name("AFSXCTL")
	.dwattr $C$DW$296, DW_AT_TI_symbol_name("_AFSXCTL")
	.dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0xac]
	.dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$297	.dwtag  DW_TAG_member
	.dwattr $C$DW$297, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$297, DW_AT_name("ACLKXCTL")
	.dwattr $C$DW$297, DW_AT_TI_symbol_name("_ACLKXCTL")
	.dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
	.dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$298	.dwtag  DW_TAG_member
	.dwattr $C$DW$298, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$298, DW_AT_name("AHCLKXCTL")
	.dwattr $C$DW$298, DW_AT_TI_symbol_name("_AHCLKXCTL")
	.dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0xb4]
	.dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$299	.dwtag  DW_TAG_member
	.dwattr $C$DW$299, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$299, DW_AT_name("XTDM")
	.dwattr $C$DW$299, DW_AT_TI_symbol_name("_XTDM")
	.dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0xb8]
	.dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$300	.dwtag  DW_TAG_member
	.dwattr $C$DW$300, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$300, DW_AT_name("XINTCTL")
	.dwattr $C$DW$300, DW_AT_TI_symbol_name("_XINTCTL")
	.dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
	.dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$301	.dwtag  DW_TAG_member
	.dwattr $C$DW$301, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$301, DW_AT_name("XSTAT")
	.dwattr $C$DW$301, DW_AT_TI_symbol_name("_XSTAT")
	.dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
	.dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$302	.dwtag  DW_TAG_member
	.dwattr $C$DW$302, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$302, DW_AT_name("XSLOT")
	.dwattr $C$DW$302, DW_AT_TI_symbol_name("_XSLOT")
	.dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
	.dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$303	.dwtag  DW_TAG_member
	.dwattr $C$DW$303, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$303, DW_AT_name("XCLKCHK")
	.dwattr $C$DW$303, DW_AT_TI_symbol_name("_XCLKCHK")
	.dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
	.dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$304	.dwtag  DW_TAG_member
	.dwattr $C$DW$304, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$304, DW_AT_name("XEVTCTL")
	.dwattr $C$DW$304, DW_AT_TI_symbol_name("_XEVTCTL")
	.dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
	.dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$305	.dwtag  DW_TAG_member
	.dwattr $C$DW$305, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$305, DW_AT_name("RSVD4")
	.dwattr $C$DW$305, DW_AT_TI_symbol_name("_RSVD4")
	.dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
	.dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$306	.dwtag  DW_TAG_member
	.dwattr $C$DW$306, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$306, DW_AT_name("DITCSRA0")
	.dwattr $C$DW$306, DW_AT_TI_symbol_name("_DITCSRA0")
	.dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
	.dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$307	.dwtag  DW_TAG_member
	.dwattr $C$DW$307, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$307, DW_AT_name("DITCSRA1")
	.dwattr $C$DW$307, DW_AT_TI_symbol_name("_DITCSRA1")
	.dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
	.dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$308	.dwtag  DW_TAG_member
	.dwattr $C$DW$308, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$308, DW_AT_name("DITCSRA2")
	.dwattr $C$DW$308, DW_AT_TI_symbol_name("_DITCSRA2")
	.dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x108]
	.dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$309	.dwtag  DW_TAG_member
	.dwattr $C$DW$309, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$309, DW_AT_name("DITCSRA3")
	.dwattr $C$DW$309, DW_AT_TI_symbol_name("_DITCSRA3")
	.dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x10c]
	.dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$310	.dwtag  DW_TAG_member
	.dwattr $C$DW$310, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$310, DW_AT_name("DITCSRA4")
	.dwattr $C$DW$310, DW_AT_TI_symbol_name("_DITCSRA4")
	.dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x110]
	.dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$311	.dwtag  DW_TAG_member
	.dwattr $C$DW$311, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$311, DW_AT_name("DITCSRA5")
	.dwattr $C$DW$311, DW_AT_TI_symbol_name("_DITCSRA5")
	.dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x114]
	.dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$312	.dwtag  DW_TAG_member
	.dwattr $C$DW$312, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$312, DW_AT_name("DITCSRB0")
	.dwattr $C$DW$312, DW_AT_TI_symbol_name("_DITCSRB0")
	.dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x118]
	.dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$313	.dwtag  DW_TAG_member
	.dwattr $C$DW$313, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$313, DW_AT_name("DITCSRB1")
	.dwattr $C$DW$313, DW_AT_TI_symbol_name("_DITCSRB1")
	.dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x11c]
	.dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$314	.dwtag  DW_TAG_member
	.dwattr $C$DW$314, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$314, DW_AT_name("DITCSRB2")
	.dwattr $C$DW$314, DW_AT_TI_symbol_name("_DITCSRB2")
	.dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
	.dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$315	.dwtag  DW_TAG_member
	.dwattr $C$DW$315, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$315, DW_AT_name("DITCSRB3")
	.dwattr $C$DW$315, DW_AT_TI_symbol_name("_DITCSRB3")
	.dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x124]
	.dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$316	.dwtag  DW_TAG_member
	.dwattr $C$DW$316, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$316, DW_AT_name("DITCSRB4")
	.dwattr $C$DW$316, DW_AT_TI_symbol_name("_DITCSRB4")
	.dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x128]
	.dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$317	.dwtag  DW_TAG_member
	.dwattr $C$DW$317, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$317, DW_AT_name("DITCSRB5")
	.dwattr $C$DW$317, DW_AT_TI_symbol_name("_DITCSRB5")
	.dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x12c]
	.dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$318	.dwtag  DW_TAG_member
	.dwattr $C$DW$318, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$318, DW_AT_name("DITUDRA0")
	.dwattr $C$DW$318, DW_AT_TI_symbol_name("_DITUDRA0")
	.dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x130]
	.dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$319	.dwtag  DW_TAG_member
	.dwattr $C$DW$319, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$319, DW_AT_name("DITUDRA1")
	.dwattr $C$DW$319, DW_AT_TI_symbol_name("_DITUDRA1")
	.dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x134]
	.dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$320	.dwtag  DW_TAG_member
	.dwattr $C$DW$320, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$320, DW_AT_name("DITUDRA2")
	.dwattr $C$DW$320, DW_AT_TI_symbol_name("_DITUDRA2")
	.dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x138]
	.dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$321	.dwtag  DW_TAG_member
	.dwattr $C$DW$321, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$321, DW_AT_name("DITUDRA3")
	.dwattr $C$DW$321, DW_AT_TI_symbol_name("_DITUDRA3")
	.dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x13c]
	.dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$322	.dwtag  DW_TAG_member
	.dwattr $C$DW$322, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$322, DW_AT_name("DITUDRA4")
	.dwattr $C$DW$322, DW_AT_TI_symbol_name("_DITUDRA4")
	.dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x140]
	.dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$323	.dwtag  DW_TAG_member
	.dwattr $C$DW$323, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$323, DW_AT_name("DITUDRA5")
	.dwattr $C$DW$323, DW_AT_TI_symbol_name("_DITUDRA5")
	.dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x144]
	.dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$324	.dwtag  DW_TAG_member
	.dwattr $C$DW$324, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$324, DW_AT_name("DITUDRB0")
	.dwattr $C$DW$324, DW_AT_TI_symbol_name("_DITUDRB0")
	.dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x148]
	.dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$325	.dwtag  DW_TAG_member
	.dwattr $C$DW$325, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$325, DW_AT_name("DITUDRB1")
	.dwattr $C$DW$325, DW_AT_TI_symbol_name("_DITUDRB1")
	.dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x14c]
	.dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$326	.dwtag  DW_TAG_member
	.dwattr $C$DW$326, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$326, DW_AT_name("DITUDRB2")
	.dwattr $C$DW$326, DW_AT_TI_symbol_name("_DITUDRB2")
	.dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x150]
	.dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$327	.dwtag  DW_TAG_member
	.dwattr $C$DW$327, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$327, DW_AT_name("DITUDRB3")
	.dwattr $C$DW$327, DW_AT_TI_symbol_name("_DITUDRB3")
	.dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x154]
	.dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$328	.dwtag  DW_TAG_member
	.dwattr $C$DW$328, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$328, DW_AT_name("DITUDRB4")
	.dwattr $C$DW$328, DW_AT_TI_symbol_name("_DITUDRB4")
	.dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x158]
	.dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$329	.dwtag  DW_TAG_member
	.dwattr $C$DW$329, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$329, DW_AT_name("DITUDRB5")
	.dwattr $C$DW$329, DW_AT_TI_symbol_name("_DITUDRB5")
	.dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x15c]
	.dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$330	.dwtag  DW_TAG_member
	.dwattr $C$DW$330, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$330, DW_AT_name("RSVD5")
	.dwattr $C$DW$330, DW_AT_TI_symbol_name("_RSVD5")
	.dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x160]
	.dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$331	.dwtag  DW_TAG_member
	.dwattr $C$DW$331, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$331, DW_AT_name("SRCTL0")
	.dwattr $C$DW$331, DW_AT_TI_symbol_name("_SRCTL0")
	.dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x180]
	.dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$332	.dwtag  DW_TAG_member
	.dwattr $C$DW$332, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$332, DW_AT_name("SRCTL1")
	.dwattr $C$DW$332, DW_AT_TI_symbol_name("_SRCTL1")
	.dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x184]
	.dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$333	.dwtag  DW_TAG_member
	.dwattr $C$DW$333, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$333, DW_AT_name("SRCTL2")
	.dwattr $C$DW$333, DW_AT_TI_symbol_name("_SRCTL2")
	.dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x188]
	.dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$334	.dwtag  DW_TAG_member
	.dwattr $C$DW$334, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$334, DW_AT_name("SRCTL3")
	.dwattr $C$DW$334, DW_AT_TI_symbol_name("_SRCTL3")
	.dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x18c]
	.dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$335	.dwtag  DW_TAG_member
	.dwattr $C$DW$335, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$335, DW_AT_name("SRCTL4")
	.dwattr $C$DW$335, DW_AT_TI_symbol_name("_SRCTL4")
	.dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x190]
	.dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$336	.dwtag  DW_TAG_member
	.dwattr $C$DW$336, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$336, DW_AT_name("SRCTL5")
	.dwattr $C$DW$336, DW_AT_TI_symbol_name("_SRCTL5")
	.dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x194]
	.dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$337	.dwtag  DW_TAG_member
	.dwattr $C$DW$337, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$337, DW_AT_name("SRCTL6")
	.dwattr $C$DW$337, DW_AT_TI_symbol_name("_SRCTL6")
	.dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x198]
	.dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$338	.dwtag  DW_TAG_member
	.dwattr $C$DW$338, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$338, DW_AT_name("SRCTL7")
	.dwattr $C$DW$338, DW_AT_TI_symbol_name("_SRCTL7")
	.dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x19c]
	.dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$339	.dwtag  DW_TAG_member
	.dwattr $C$DW$339, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$339, DW_AT_name("SRCTL8")
	.dwattr $C$DW$339, DW_AT_TI_symbol_name("_SRCTL8")
	.dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a0]
	.dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$340	.dwtag  DW_TAG_member
	.dwattr $C$DW$340, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$340, DW_AT_name("SRCTL9")
	.dwattr $C$DW$340, DW_AT_TI_symbol_name("_SRCTL9")
	.dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a4]
	.dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$341	.dwtag  DW_TAG_member
	.dwattr $C$DW$341, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$341, DW_AT_name("SRCTL10")
	.dwattr $C$DW$341, DW_AT_TI_symbol_name("_SRCTL10")
	.dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a8]
	.dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$342	.dwtag  DW_TAG_member
	.dwattr $C$DW$342, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$342, DW_AT_name("SRCTL11")
	.dwattr $C$DW$342, DW_AT_TI_symbol_name("_SRCTL11")
	.dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x1ac]
	.dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$343	.dwtag  DW_TAG_member
	.dwattr $C$DW$343, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$343, DW_AT_name("SRCTL12")
	.dwattr $C$DW$343, DW_AT_TI_symbol_name("_SRCTL12")
	.dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b0]
	.dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$344	.dwtag  DW_TAG_member
	.dwattr $C$DW$344, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$344, DW_AT_name("SRCTL13")
	.dwattr $C$DW$344, DW_AT_TI_symbol_name("_SRCTL13")
	.dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b4]
	.dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$345	.dwtag  DW_TAG_member
	.dwattr $C$DW$345, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$345, DW_AT_name("SRCTL14")
	.dwattr $C$DW$345, DW_AT_TI_symbol_name("_SRCTL14")
	.dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b8]
	.dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$346	.dwtag  DW_TAG_member
	.dwattr $C$DW$346, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$346, DW_AT_name("SRCTL15")
	.dwattr $C$DW$346, DW_AT_TI_symbol_name("_SRCTL15")
	.dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x1bc]
	.dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$347	.dwtag  DW_TAG_member
	.dwattr $C$DW$347, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$347, DW_AT_name("RSVD6")
	.dwattr $C$DW$347, DW_AT_TI_symbol_name("_RSVD6")
	.dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c0]
	.dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$348	.dwtag  DW_TAG_member
	.dwattr $C$DW$348, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$348, DW_AT_name("XBUF0")
	.dwattr $C$DW$348, DW_AT_TI_symbol_name("_XBUF0")
	.dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x200]
	.dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$349	.dwtag  DW_TAG_member
	.dwattr $C$DW$349, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$349, DW_AT_name("XBUF1")
	.dwattr $C$DW$349, DW_AT_TI_symbol_name("_XBUF1")
	.dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x204]
	.dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$350	.dwtag  DW_TAG_member
	.dwattr $C$DW$350, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$350, DW_AT_name("XBUF2")
	.dwattr $C$DW$350, DW_AT_TI_symbol_name("_XBUF2")
	.dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x208]
	.dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$351	.dwtag  DW_TAG_member
	.dwattr $C$DW$351, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$351, DW_AT_name("XBUF3")
	.dwattr $C$DW$351, DW_AT_TI_symbol_name("_XBUF3")
	.dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x20c]
	.dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$352	.dwtag  DW_TAG_member
	.dwattr $C$DW$352, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$352, DW_AT_name("XBUF4")
	.dwattr $C$DW$352, DW_AT_TI_symbol_name("_XBUF4")
	.dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x210]
	.dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$353	.dwtag  DW_TAG_member
	.dwattr $C$DW$353, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$353, DW_AT_name("XBUF5")
	.dwattr $C$DW$353, DW_AT_TI_symbol_name("_XBUF5")
	.dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x214]
	.dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$354	.dwtag  DW_TAG_member
	.dwattr $C$DW$354, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$354, DW_AT_name("XBUF6")
	.dwattr $C$DW$354, DW_AT_TI_symbol_name("_XBUF6")
	.dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x218]
	.dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$355	.dwtag  DW_TAG_member
	.dwattr $C$DW$355, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$355, DW_AT_name("XBUF7")
	.dwattr $C$DW$355, DW_AT_TI_symbol_name("_XBUF7")
	.dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x21c]
	.dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$356	.dwtag  DW_TAG_member
	.dwattr $C$DW$356, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$356, DW_AT_name("XBUF8")
	.dwattr $C$DW$356, DW_AT_TI_symbol_name("_XBUF8")
	.dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x220]
	.dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$357	.dwtag  DW_TAG_member
	.dwattr $C$DW$357, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$357, DW_AT_name("XBUF9")
	.dwattr $C$DW$357, DW_AT_TI_symbol_name("_XBUF9")
	.dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x224]
	.dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$358	.dwtag  DW_TAG_member
	.dwattr $C$DW$358, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$358, DW_AT_name("XBUF10")
	.dwattr $C$DW$358, DW_AT_TI_symbol_name("_XBUF10")
	.dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x228]
	.dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$359	.dwtag  DW_TAG_member
	.dwattr $C$DW$359, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$359, DW_AT_name("XBUF11")
	.dwattr $C$DW$359, DW_AT_TI_symbol_name("_XBUF11")
	.dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x22c]
	.dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$360	.dwtag  DW_TAG_member
	.dwattr $C$DW$360, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$360, DW_AT_name("XBUF12")
	.dwattr $C$DW$360, DW_AT_TI_symbol_name("_XBUF12")
	.dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x230]
	.dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$361	.dwtag  DW_TAG_member
	.dwattr $C$DW$361, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$361, DW_AT_name("XBUF13")
	.dwattr $C$DW$361, DW_AT_TI_symbol_name("_XBUF13")
	.dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x234]
	.dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$362	.dwtag  DW_TAG_member
	.dwattr $C$DW$362, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$362, DW_AT_name("XBUF14")
	.dwattr $C$DW$362, DW_AT_TI_symbol_name("_XBUF14")
	.dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x238]
	.dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$363	.dwtag  DW_TAG_member
	.dwattr $C$DW$363, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$363, DW_AT_name("XBUF15")
	.dwattr $C$DW$363, DW_AT_TI_symbol_name("_XBUF15")
	.dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x23c]
	.dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$364	.dwtag  DW_TAG_member
	.dwattr $C$DW$364, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$364, DW_AT_name("RSVD7")
	.dwattr $C$DW$364, DW_AT_TI_symbol_name("_RSVD7")
	.dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x240]
	.dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$365	.dwtag  DW_TAG_member
	.dwattr $C$DW$365, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$365, DW_AT_name("RBUF0")
	.dwattr $C$DW$365, DW_AT_TI_symbol_name("_RBUF0")
	.dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x280]
	.dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$366	.dwtag  DW_TAG_member
	.dwattr $C$DW$366, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$366, DW_AT_name("RBUF1")
	.dwattr $C$DW$366, DW_AT_TI_symbol_name("_RBUF1")
	.dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x284]
	.dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$367	.dwtag  DW_TAG_member
	.dwattr $C$DW$367, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$367, DW_AT_name("RBUF2")
	.dwattr $C$DW$367, DW_AT_TI_symbol_name("_RBUF2")
	.dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x288]
	.dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$368	.dwtag  DW_TAG_member
	.dwattr $C$DW$368, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$368, DW_AT_name("RBUF3")
	.dwattr $C$DW$368, DW_AT_TI_symbol_name("_RBUF3")
	.dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x28c]
	.dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$369	.dwtag  DW_TAG_member
	.dwattr $C$DW$369, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$369, DW_AT_name("RBUF4")
	.dwattr $C$DW$369, DW_AT_TI_symbol_name("_RBUF4")
	.dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x290]
	.dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$370	.dwtag  DW_TAG_member
	.dwattr $C$DW$370, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$370, DW_AT_name("RBUF5")
	.dwattr $C$DW$370, DW_AT_TI_symbol_name("_RBUF5")
	.dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x294]
	.dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$371	.dwtag  DW_TAG_member
	.dwattr $C$DW$371, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$371, DW_AT_name("RBUF6")
	.dwattr $C$DW$371, DW_AT_TI_symbol_name("_RBUF6")
	.dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x298]
	.dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$372	.dwtag  DW_TAG_member
	.dwattr $C$DW$372, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$372, DW_AT_name("RBUF7")
	.dwattr $C$DW$372, DW_AT_TI_symbol_name("_RBUF7")
	.dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x29c]
	.dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$373	.dwtag  DW_TAG_member
	.dwattr $C$DW$373, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$373, DW_AT_name("RBUF8")
	.dwattr $C$DW$373, DW_AT_TI_symbol_name("_RBUF8")
	.dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a0]
	.dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$374	.dwtag  DW_TAG_member
	.dwattr $C$DW$374, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$374, DW_AT_name("RBUF9")
	.dwattr $C$DW$374, DW_AT_TI_symbol_name("_RBUF9")
	.dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a4]
	.dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$375	.dwtag  DW_TAG_member
	.dwattr $C$DW$375, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$375, DW_AT_name("RBUF10")
	.dwattr $C$DW$375, DW_AT_TI_symbol_name("_RBUF10")
	.dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a8]
	.dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$376	.dwtag  DW_TAG_member
	.dwattr $C$DW$376, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$376, DW_AT_name("RBUF11")
	.dwattr $C$DW$376, DW_AT_TI_symbol_name("_RBUF11")
	.dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x2ac]
	.dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$377	.dwtag  DW_TAG_member
	.dwattr $C$DW$377, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$377, DW_AT_name("RBUF12")
	.dwattr $C$DW$377, DW_AT_TI_symbol_name("_RBUF12")
	.dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b0]
	.dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$378	.dwtag  DW_TAG_member
	.dwattr $C$DW$378, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$378, DW_AT_name("RBUF13")
	.dwattr $C$DW$378, DW_AT_TI_symbol_name("_RBUF13")
	.dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b4]
	.dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$379	.dwtag  DW_TAG_member
	.dwattr $C$DW$379, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$379, DW_AT_name("RBUF14")
	.dwattr $C$DW$379, DW_AT_TI_symbol_name("_RBUF14")
	.dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b8]
	.dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$380	.dwtag  DW_TAG_member
	.dwattr $C$DW$380, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$380, DW_AT_name("RBUF15")
	.dwattr $C$DW$380, DW_AT_TI_symbol_name("_RBUF15")
	.dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x2bc]
	.dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$35

$C$DW$T$43	.dwtag  DW_TAG_typedef, DW_AT_name("mcasp_regs_t")
	.dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)

$C$DW$T$37	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$37, DW_AT_byte_size(0x04)
$C$DW$381	.dwtag  DW_TAG_member
	.dwattr $C$DW$381, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$381, DW_AT_name("uint")
	.dwattr $C$DW$381, DW_AT_TI_symbol_name("_uint")
	.dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$382	.dwtag  DW_TAG_member
	.dwattr $C$DW$382, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$382, DW_AT_name("channel")
	.dwattr $C$DW$382, DW_AT_TI_symbol_name("_channel")
	.dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$37

$C$DW$T$45	.dwtag  DW_TAG_typedef, DW_AT_name("AIC31_data_type")
	.dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)

$C$DW$T$38	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$38, DW_AT_name("BITVAL")
	.dwattr $C$DW$T$38, DW_AT_byte_size(0x02)
$C$DW$383	.dwtag  DW_TAG_member
	.dwattr $C$DW$383, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$383, DW_AT_name("b0")
	.dwattr $C$DW$383, DW_AT_TI_symbol_name("_b0")
	.dwattr $C$DW$383, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
	.dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$384	.dwtag  DW_TAG_member
	.dwattr $C$DW$384, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$384, DW_AT_name("b1")
	.dwattr $C$DW$384, DW_AT_TI_symbol_name("_b1")
	.dwattr $C$DW$384, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
	.dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$385	.dwtag  DW_TAG_member
	.dwattr $C$DW$385, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$385, DW_AT_name("b2")
	.dwattr $C$DW$385, DW_AT_TI_symbol_name("_b2")
	.dwattr $C$DW$385, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
	.dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$386	.dwtag  DW_TAG_member
	.dwattr $C$DW$386, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$386, DW_AT_name("b3")
	.dwattr $C$DW$386, DW_AT_TI_symbol_name("_b3")
	.dwattr $C$DW$386, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x01)
	.dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$387	.dwtag  DW_TAG_member
	.dwattr $C$DW$387, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$387, DW_AT_name("b4")
	.dwattr $C$DW$387, DW_AT_TI_symbol_name("_b4")
	.dwattr $C$DW$387, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
	.dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$388	.dwtag  DW_TAG_member
	.dwattr $C$DW$388, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$388, DW_AT_name("b5")
	.dwattr $C$DW$388, DW_AT_TI_symbol_name("_b5")
	.dwattr $C$DW$388, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
	.dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$389	.dwtag  DW_TAG_member
	.dwattr $C$DW$389, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$389, DW_AT_name("b6")
	.dwattr $C$DW$389, DW_AT_TI_symbol_name("_b6")
	.dwattr $C$DW$389, DW_AT_bit_offset(0x19), DW_AT_bit_size(0x01)
	.dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$390	.dwtag  DW_TAG_member
	.dwattr $C$DW$390, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$390, DW_AT_name("b7")
	.dwattr $C$DW$390, DW_AT_TI_symbol_name("_b7")
	.dwattr $C$DW$390, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x01)
	.dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$391	.dwtag  DW_TAG_member
	.dwattr $C$DW$391, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$391, DW_AT_name("b8")
	.dwattr $C$DW$391, DW_AT_TI_symbol_name("_b8")
	.dwattr $C$DW$391, DW_AT_bit_offset(0x17), DW_AT_bit_size(0x01)
	.dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$392	.dwtag  DW_TAG_member
	.dwattr $C$DW$392, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$392, DW_AT_name("b9")
	.dwattr $C$DW$392, DW_AT_TI_symbol_name("_b9")
	.dwattr $C$DW$392, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x01)
	.dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$393	.dwtag  DW_TAG_member
	.dwattr $C$DW$393, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$393, DW_AT_name("b10")
	.dwattr $C$DW$393, DW_AT_TI_symbol_name("_b10")
	.dwattr $C$DW$393, DW_AT_bit_offset(0x15), DW_AT_bit_size(0x01)
	.dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$394	.dwtag  DW_TAG_member
	.dwattr $C$DW$394, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$394, DW_AT_name("b11")
	.dwattr $C$DW$394, DW_AT_TI_symbol_name("_b11")
	.dwattr $C$DW$394, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x01)
	.dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$395	.dwtag  DW_TAG_member
	.dwattr $C$DW$395, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$395, DW_AT_name("b12")
	.dwattr $C$DW$395, DW_AT_TI_symbol_name("_b12")
	.dwattr $C$DW$395, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x01)
	.dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$396	.dwtag  DW_TAG_member
	.dwattr $C$DW$396, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$396, DW_AT_name("b13")
	.dwattr $C$DW$396, DW_AT_TI_symbol_name("_b13")
	.dwattr $C$DW$396, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
	.dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$397	.dwtag  DW_TAG_member
	.dwattr $C$DW$397, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$397, DW_AT_name("dweebie")
	.dwattr $C$DW$397, DW_AT_TI_symbol_name("_dweebie")
	.dwattr $C$DW$397, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x02)
	.dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$38

$C$DW$T$39	.dwtag  DW_TAG_typedef, DW_AT_name("bitval")
	.dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)

$C$DW$T$40	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$40, DW_AT_name("SHIFT_REG")
	.dwattr $C$DW$T$40, DW_AT_byte_size(0x04)
$C$DW$398	.dwtag  DW_TAG_member
	.dwattr $C$DW$398, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$398, DW_AT_name("regval")
	.dwattr $C$DW$398, DW_AT_TI_symbol_name("_regval")
	.dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$399	.dwtag  DW_TAG_member
	.dwattr $C$DW$399, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$399, DW_AT_name("bt")
	.dwattr $C$DW$399, DW_AT_TI_symbol_name("_bt")
	.dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$40

$C$DW$T$46	.dwtag  DW_TAG_typedef, DW_AT_name("shift_reg")
	.dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
$C$DW$T$3	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$3, DW_AT_address_class(0x20)
$C$DW$T$4	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
	.dwattr $C$DW$T$4, DW_AT_name("bool")
	.dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
$C$DW$T$5	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$5, DW_AT_name("signed char")
	.dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
$C$DW$T$6	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
	.dwattr $C$DW$T$6, DW_AT_name("unsigned char")
	.dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
$C$DW$T$52	.dwtag  DW_TAG_typedef, DW_AT_name("uint8_t")
	.dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
$C$DW$T$7	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$7, DW_AT_name("wchar_t")
	.dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
$C$DW$T$8	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$8, DW_AT_name("short")
	.dwattr $C$DW$T$8, DW_AT_byte_size(0x02)

$C$DW$T$36	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$36, DW_AT_byte_size(0x04)
$C$DW$400	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$400, DW_AT_upper_bound(0x01)
	.dwendtag $C$DW$T$36

$C$DW$T$59	.dwtag  DW_TAG_typedef, DW_AT_name("int16_t")
	.dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
$C$DW$T$69	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$59)
	.dwattr $C$DW$T$69, DW_AT_address_class(0x20)
$C$DW$T$9	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$9, DW_AT_name("unsigned short")
	.dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
$C$DW$T$10	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$10, DW_AT_name("int")
	.dwattr $C$DW$T$10, DW_AT_byte_size(0x04)
$C$DW$T$57	.dwtag  DW_TAG_typedef, DW_AT_name("int32_t")
	.dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
$C$DW$T$11	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$11, DW_AT_name("unsigned int")
	.dwattr $C$DW$T$11, DW_AT_byte_size(0x04)
$C$DW$T$47	.dwtag  DW_TAG_typedef, DW_AT_name("size_t")
	.dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
$C$DW$T$19	.dwtag  DW_TAG_typedef, DW_AT_name("uint32_t")
	.dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
$C$DW$T$80	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$80, DW_AT_address_class(0x20)
$C$DW$T$20	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$19)

$C$DW$T$21	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$21, DW_AT_byte_size(0x14)
$C$DW$401	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$401, DW_AT_upper_bound(0x04)
	.dwendtag $C$DW$T$21


$C$DW$T$22	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$22, DW_AT_byte_size(0x24)
$C$DW$402	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$402, DW_AT_upper_bound(0x08)
	.dwendtag $C$DW$T$22


$C$DW$T$23	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$23, DW_AT_byte_size(0x0c)
$C$DW$403	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$403, DW_AT_upper_bound(0x02)
	.dwendtag $C$DW$T$23


